tests/load/artillery.yml
# Artillery load test — Issue #113: 50 Concurrent Users on Critical API Endpoints
#
# Prerequisites: the Express server must be running before executing this test.
#   Local:    npm run dev  (in apps/server)
#   Deployed: set LOAD_TEST_TARGET to the deployed URL
#
# Usage:
#   npm run load-test              # against http://localhost:4000
#   LOAD_TEST_TARGET=https://your-deployment.vercel.app npm run load-test:url
#
# Endpoints covered:
#   GET  /api/health                        — liveness probe
#   GET  /api/animals                       — main listing with filter/sort/pagination
#   GET  /api/animals/filters               — filter option values
#   GET  /api/animals/:id                   — single animal detail (adoption page source)
#   GET  /api/uploads/config                — upload service readiness
#
# Adoption form redirect: the "Solicitud de Adopción" flow redirects users to an
# external Google Form URL constructed client-side. There is no server-side redirect
# endpoint, so it cannot be exercised in an API load test.
#
# Image upload (POST /api/uploads/animals/:id/image): requires live Cloudflare R2
# credentials and binary multipart data. Load testing this endpoint without R2
# would only exercise error-handling paths (R2_NOT_CONFIGURED 500), not real
# upload capacity. Covered separately by unit/integration tests in r2Service.test.js.

config:
  target: "{{ $processEnvironment.LOAD_TEST_TARGET }}"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 50
      name: "Ramp up (0 → 50 VU)"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load (50 VU)"
  processor: "./processor.js"
  defaults:
    headers:
      Accept: "application/json"
  # CI pass/fail gate — loosest across all endpoints
  ensure:
    p95: 1000
    maxErrorRate: 1

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "List Animals"
    weight: 45
    beforeScenario: "generateQueryVariations"
    flow:
      - get:
          url: "/api/animals"
          qs:
            limit: "{{ limit }}"
            offset: "{{ offset }}"
            species: "{{ species }}"
            status: "{{ animalStatus }}"
          expect:
            - statusCode: 200

  - name: "Filter Options"
    weight: 15
    flow:
      - get:
          url: "/api/animals/filters"
          expect:
            - statusCode: 200

  - name: "Single Animal"
    weight: 20
    beforeScenario: "setAnimalId"
    flow:
      - get:
          url: "/api/animals/{{ animalId }}"
          expect:
            - statusCode:
                - 200
                - 404

  - name: "Upload Config"
    weight: 10
    flow:
      - get:
          url: "/api/uploads/config"
          expect:
            - statusCode: 200